shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/platform/dfu_flash.c
#include <string.h>
#include "trace.h"
#include "flash_device.h"
#include "patch_header_check.h"
#include "hw_aes.h"
#include "rtl876x_hw_aes.h"
#include "otp.h"
#include "dfu_api.h"
#include "rtl876x_wdg.h"
#include "dfu_flash.h"
#include "sha256.h"
#include "crc16btx.h"
#include "board.h"
#include "otp_config.h"

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
#if ((USER_DATA_START_ADDR & (FMC_BLK_SECTION_LEN - 1)) != 0)
#error "User data start addr is not 64KB Aligned!!"
#endif
#endif

/*============================================================================*
 *                              Macros
 *============================================================================*/
#define BTAON_FAST_REBOOT_SW_INFO0              0x2

#define DECODE_OFFSET                           (sizeof(T_COMPRESS_IMG_HEADER_FORMAT))
#define COMPRESS_HEADER_SHA256_OFFSET           36

#define CRC_BUFFER_SIZE                         128  //may modify to improve performance
#define SHA256_BUFFER_SIZE                      128

#define SHA256_LENGTH                           32

#define DFU_UPDATE_LEN                          256

/*============================================================================*
 *                               Types
 *============================================================================*/
typedef union _BTAON_FAST_REBOOT_SW_INFO0_TYPE
{
    uint16_t d16;
    struct
    {
        uint16_t rsvd0:                      5;
        uint16_t is_ota:                     1;  /* bit[5]: enter ota mode after reset           */
        uint16_t rsvd1:                      10;
    } flag;
} BTAON_FAST_REBOOT_SW_INFO0_TYPE;

/*============================================================================*
 *                               Variables
 *============================================================================*/
static uint32_t img_total_len = 0;
static uint32_t total_block_cnt = 0;
static uint32_t block_cnt = 0;
uint8_t g_flash_old_bp_lv = 0xff;
/*============================================================================*
 *                              Local Functions
 *============================================================================*/
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
static bool dfu_check_compressed_image_crc(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  - CRC
        */

    uint8_t buf[CRC_BUFFER_SIZE];
    uint16_t calced_crc16;

    uint32_t length = p_header->payload_len;
    uint8_t *pdata = (uint8_t *) p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    calced_crc16 = dfu_process_crc(BTXFCS_INIT, buf, CRC_BUFFER_SIZE, pdata, length);

    return (p_header->crc16 == calced_crc16);
}

static bool dfu_check_compressed_image_sha256(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /*
           Image layout is as below, and CRC will include part 2)
           1) Image Compress Header    96 bytes
           2) compressed app + header  bytes  -sha256
        */

    SHA256_CTX ctx;
    uint8_t buf[SHA256_BUFFER_SIZE];
    uint8_t sha256sum[SHA256_LENGTH];
    uint8_t sha256img[SHA256_LENGTH];

    SHA256_Init(&ctx);

    uint8_t *pdata = (uint8_t *)p_header + sizeof(T_COMPRESS_IMG_HEADER_FORMAT);
    dfu_process_sha256(&ctx, buf, SHA256_BUFFER_SIZE, pdata, p_header->payload_len);

    SHA256_Final(&ctx, sha256sum);

    pdata = (uint8_t *)p_header + COMPRESS_HEADER_SHA256_OFFSET;
    for (int i = 0; i < SHA256_LENGTH; i++)
    {
        sha256img[i] = *(pdata++);
    }

    return (memcmp(sha256img, sha256sum, SHA256_LENGTH) == 0);
}

/**
 * @brief  calculated checksum(CRC16 or SHA256 determined by image) over the image, and compared
 *         with given checksum value.
 * @param  p_header image header info of the given image.
 * @return true if image integrity check pass via checksum compare, false otherwise.
*/
static bool check_compressed_image_chksum(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    bool ret;

    if (p_header->crc16)
    {
        ret = dfu_check_compressed_image_crc(p_header);
    }
    else
    {
        ret = dfu_check_compressed_image_sha256(p_header);
    }

    return ret;
}

#endif
/**
 * @brief erase a sector of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
static bool flash_erase_sector(uint32_t addr)
{
    bool result = false;
    result = flash_erase_locked(FLASH_ERASE_SECTOR, addr);
    DFU_PRINT_INFO2("<==dfu flash erase sector: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
 * @brief erase a block of the flash.
 * @param  addr   flash addr in sector to be erase.
 * @return  0 if erase successfully, fail otherwise
*/
static bool flash_erase_block(uint32_t addr)
{
    bool result = false;
    result = flash_erase_locked(FLASH_ERASE_BLOCK, addr);
    DFU_PRINT_INFO2("<==dfu flash erase block: addr=%x, result=%d(1:success)", addr, result);
    return result;
}

/**
* @brief check flash area is blank
* @param  image_id          image_id to identify FW.
* @param  offset             offset of the image.
* @param  size               size to check.
* @return  0 if blank check successfully, error line number otherwise
*/
static uint32_t dfu_flash_check_blank(uint16_t image_id, uint32_t offset, uint16_t size)
{
    uint32_t i = 0;
    uint32_t result = 0;
    uint32_t start_addr = 0;

    if (size & 0x3)
    {
        result = __LINE__;
        goto L_Return;
    }

    if ((image_id != IMAGE_USER_DATA) &&
        (image_id < OTA || image_id >= IMAGE_MAX))
    {
        result = __LINE__;
        goto L_Return;
    }

    if (image_id == IMAGE_USER_DATA)
    {
        start_addr = flash_get_bank_addr(FLASH_BKP_DATA1) + offset;
    }
    else
    {
        start_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id) + offset;
    }

    if (start_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    for (i = 0; i < size / 4; i++)
    {
        uint32_t r_data;
        if (flash_auto_read_locked(start_addr, &r_data))
        {
            if (r_data != FMC_ERASE_PATTERN)
            {
                result = __LINE__;
                goto L_Return;
            }
            start_addr += 4;
        }
        else
        {
            result = __LINE__;
            goto L_Return;
        }
    }

