shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/platform/dfu_flash.c
L_Return:
    DFU_PRINT_INFO4("<==dfu_flash_check_blank: image_id=0x%x, size=%d, addr=%d, result=%d",
                    image_id, size, start_addr, result);
    return result;
}

/**
 * @brief  set specified image valid bit..
 * @param  p_header      specified image.
 * @return true if ready bit sets to 0, false otherwise
*/
void dfu_set_compressed_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    /* clear not_ready and compressed_not_ready bit */
    uint32_t data;
    /*support for 4bit mode silent ota*/
    flash_auto_read_locked((uint32_t)p_header, &data);
    data &= ~BIT26;
    flash_auto_write_locked((uint32_t)p_header, data);
}

extern void dfu_set_ready(T_IMG_CTRL_HEADER_FORMAT *p_header);

//void dfu_set_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
//{
//    /* clear not_ready bit */
//    uint32_t data;
//    /*support for 4bit mode silent ota*/
//    flash_auto_read_locked((uint32_t)p_header, &data);
//    data &= ~BIT23;
//    flash_auto_write_locked((uint32_t)p_header, data);
//}

/**
* @brief check ota image size whether exceed flash layout address.
*/
static bool check_dfu_update_image_length(uint16_t image_id, uint32_t offset, uint32_t length,
                                          void *p_void, uint32_t *ret)
{
    uint32_t temp_bank_size = 0;
    *ret = 0;

    if (p_void == NULL)
    {
        *ret = DFU_UPDATE_ERROR_EMPTY_BUFFER;
        return false;
    }

    if (IMAGE_USER_DATA == image_id)
    {
        temp_bank_size = flash_get_bank_size(FLASH_BKP_DATA1);
    }
    else
    {
        temp_bank_size = get_temp_ota_bank_size_by_img_id((T_IMG_ID)image_id);
    }


    if (offset == 0)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        uint32_t total_length = p_header->payload_len + IMG_HEADER_SIZE;

        if (total_length > temp_bank_size)
        {
            DBG_DIRECT("New Image too large! total_length=%d, temp_bank_size=%d", total_length,
                       temp_bank_size);
            *ret = DFU_UPDATE_ERROR_IMAGE_SIZE_TOO_LARGE;
            return false;
        }
    }

    if (offset + length > temp_bank_size)
    {
        DFU_PRINT_ERROR3("New Image single packet too large! offset=%d, length=%d, temp_bank_size=%d",
                         offset, length, temp_bank_size);
        *ret = DFU_UPDATE_ERROR_PACKET_SIZE_TOO_LARGE;
        return false;
    }

    //check pass
    return true;
}

static uint32_t dfu_write(uint32_t start_addr, uint32_t length, uint8_t *p_void)
{
    uint32_t result = 0;
    uint16_t loop_cnt = 0;
    uint16_t remain_size = 0;
    uint32_t counter = 0;
    uint8_t s_val[DFU_UPDATE_LEN];

    loop_cnt = length / DFU_UPDATE_LEN;
    remain_size = length % DFU_UPDATE_LEN;
    DFU_PRINT_INFO2("dfu_write: start_addr=0x%x, length=%d",
                    start_addr, length);

#if 0  //auto mode access
    for (int i = 0; i < length; i = i + 4)
    {
        uint32_t s_val = 0;
        flash_auto_write_locked(start_addr + i, *(uint32_t *)p_void);
        flash_auto_read_locked(start_addr + i | FLASH_OFFSET_TO_NO_CACHE, &s_val);
        if (s_val != *(uint32_t *)p_void)
        {
            DFU_PRINT_ERROR3("<==dfu_update: ERROR! w_data=0x%x, r_data=0x%x, addr=0x%x",
                             *(uint32_t *)p_void, s_val, start_addr + i);
            result = __LINE__; //write fail
            goto L_Return;
        }
        else
        {
            p_void++;
        }
    }
#endif

    for (int i = 0; i < loop_cnt; i++)
    {
        if (flash_write_locked(start_addr + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN,
                               p_void + i * DFU_UPDATE_LEN))
        {

            if (flash_split_read_locked(start_addr + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN,
                                        s_val, &counter))
            {
                if (0 != memcmp(s_val, p_void + i * DFU_UPDATE_LEN, DFU_UPDATE_LEN))
                {
                    return DFU_UPDATE_ERROR_FLASH_READBACK_MISMATCH;
                }
            }
            else
            {
                return DFU_UPDATE_ERROR_FLASH_READBACK_FAIL;
            }
        }
        else
        {
            return DFU_UPDATE_ERROR_FLASH_WRITE_FAIL;
        }
    }

    if (remain_size)
    {
        if (flash_write_locked(start_addr + loop_cnt * DFU_UPDATE_LEN, remain_size,
                               p_void + loop_cnt * DFU_UPDATE_LEN))
        {
            if (flash_split_read_locked(start_addr + loop_cnt * DFU_UPDATE_LEN,
                                        remain_size, s_val, &counter))
            {
                //ensure p_void is ram addr
                if (0 != memcmp(s_val, p_void + loop_cnt * DFU_UPDATE_LEN, remain_size))
                {
                    return DFU_UPDATE_ERROR_FLASH_READBACK_MISMATCH;
                }
            }
            else
            {
                return DFU_UPDATE_ERROR_FLASH_READBACK_FAIL;
            }
        }
        else
        {
            return DFU_UPDATE_ERROR_FLASH_WRITE_FAIL;
        }
    }

    return result;
}

/*============================================================================*
 *                              External Functions
 *============================================================================*/
/**
 * @brief check whether in OTA mode.
*/
//bool dfu_check_ota_mode_flag(void)
//{
//    BTAON_FAST_REBOOT_SW_INFO0_TYPE nFastBoot =
//        (BTAON_FAST_REBOOT_SW_INFO0_TYPE)btaon_fast_read_safe(BTAON_FAST_REBOOT_SW_INFO0);
//    DFU_PRINT_INFO1("dfu_check_ota_mode_flag: ota(%d)", nFastBoot.flag.is_ota);

//    return nFastBoot.flag.is_ota ? true : false;
//}

/**
 * @brief set aon reg value means whether in OTA mode or not.
*/
void dfu_set_ota_mode_flag(bool enable)
{
    BTAON_FAST_REBOOT_SW_INFO0_TYPE nFastBoot =
        (BTAON_FAST_REBOOT_SW_INFO0_TYPE)btaon_fast_read_safe(BTAON_FAST_REBOOT_SW_INFO0);
    if (enable)
    {
        nFastBoot.flag.is_ota = 1;
    }
    else
    {
        nFastBoot.flag.is_ota = 0;
    }
    btaon_fast_write_safe(BTAON_FAST_REBOOT_SW_INFO0, nFastBoot.d16);
    DFU_PRINT_INFO1("dfu_set_ota_mode_flag ota(%d)", nFastBoot.flag.is_ota);
}

/**
 * @brief switch to the OTA mode, if support normal ota app need call it.
*/
void dfu_switch_to_ota_mode(void)
{
    DFU_PRINT_INFO0("[==>dfu_switch_to_ota_mode");
    dfu_set_ota_mode_flag(true);
    WDG_SystemReset(RESET_ALL_EXCEPT_AON, DFU_SWITCH_TO_OTA_MODE);
}

/**
 * @brief OTA procedure do wdg system reset.
 * @param  is_active_fw true means dfu success! otherwise fail.
*/
void dfu_fw_reboot(bool is_active_fw)
{
    DFU_PRINT_TRACE1("==>dfu_fw_reboot: is_active_fw=%d", is_active_fw);
    if (is_active_fw)
    {
        WDG_SystemReset(RESET_ALL, DFU_ACTIVE_RESET);
    }
    else
    {
        WDG_SystemReset(RESET_ALL, DFU_FAIL_RESET);
    }
}

/**
 * @brief OTA image default ecb mode aes decrypt, last less then 16bytes no encrypted.
*/
void dfu_hw_aes_decrypt_image(uint8_t *input, uint8_t *output, uint32_t length)
{
    uint32_t offset = 0;
    hw_aes_init(OTP->aes_key, NULL, AES_MODE_ECB, OTP->ota_with_encryption_use_aes256);
    do
    {
        if ((length - offset) >= 16)
        {
            hw_aes_decrypt_16byte(input + offset, output + offset);
            offset += 16;
        }
        else
        {
            break;
        }
    }
    while (1);
}

/**
 * @brief  report specified target ic type.
 * @param  image_id     image_id to identify FW.
 * @param  p_ic_type     To store ic type.
 * @return 0 if report ic type info successfully, error line number otherwise
*/
uint32_t dfu_report_target_ic_type(uint16_t image_id, uint8_t *p_ic_type)
{
    uint32_t result = 0;
    T_IMG_CTRL_HEADER_FORMAT *p_header;

    if (!p_ic_type)
    {
        result = __LINE__;
        goto L_Return;
    }

