shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/platform/dfu_flash.c
    if (IMAGE_USER_DATA == image_id)
    {
        p_header = (T_IMG_CTRL_HEADER_FORMAT *)flash_get_bank_addr(FLASH_BKP_DATA1);
    }
    else
    {
        p_header = (T_IMG_CTRL_HEADER_FORMAT *)get_header_addr_by_img_id((T_IMG_ID)image_id);
    }

    if (!p_header)
    {
        result = __LINE__;
        goto L_Return;
    }

    *p_ic_type = p_header->ic_type;

L_Return:
    DFU_PRINT_INFO1("<==dfu_report_target_ic_type: result=%d", result);
    return result;
}

/**
 * @brief  report specified FW info and current OTA offset.
 * @param  image_id          image_id to identify FW.
 * @param  p_origin_fw_version     To store current FW version.
 * @param  p_offset            To store current file offset.
 * @return 0 if report FW info successfully, error line number otherwise
*/
uint32_t dfu_report_target_fw_info(uint16_t image_id, uint32_t *p_origin_fw_version,
                                   uint32_t *p_offset)
{
    uint32_t result = 0;
    T_IMG_HEADER_FORMAT *p_header;

    if (!p_offset)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (!p_origin_fw_version)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (IMAGE_USER_DATA == image_id)
    {
        p_header = (T_IMG_HEADER_FORMAT *)flash_get_bank_addr(FLASH_BKP_DATA1);
    }
    else
    {
        p_header = (T_IMG_HEADER_FORMAT *)get_header_addr_by_img_id((T_IMG_ID)image_id);
    }
    if (!p_header)
    {
        result = __LINE__;
        goto L_Return;
    }

    if (image_id == OTA)
    {
        T_OTA_HEADER_FORMAT *p_ota_header;
        p_ota_header = (T_OTA_HEADER_FORMAT *)p_header;
        *p_origin_fw_version = p_ota_header->ver_val;
    }
    else if ((IMAGE_USER_DATA == image_id) ||
             (image_id >= SecureBoot && image_id < IMAGE_MAX))
    {
        *p_origin_fw_version = p_header->git_ver.ver_info.version;
    }
    else//image_id don't support
    {
        result = __LINE__;
        goto L_Return;
    }

    /*bee2 default don't support re-ota*/
    *p_offset = 0;

L_Return:
    DFU_PRINT_INFO1("<==dfu_report_target_fw_info: result=%d", result);
    return result;
}



/**
* @brief calculate checksum of lenth of buffer in flash.
* @param  buf                data.
* @param  length             length of data, must align 2bytes.
* @param  crc_val            ret crc value point.
* @return  0 if buffer checksum calcs successfully, error line number otherwise
*/

uint32_t dfu_check_buf_crc(uint8_t *buf, uint32_t length, uint16_t crc_val)
{
    uint16_t checksum16 = 0;
    uint32_t result = 0;
    uint32_t i;
    uint16_t *p16;

    if (length & 0x1)
    {
        result =  __LINE__;
        goto L_Return;
    }

    p16 = (uint16_t *)buf;
    for (i = 0; i < length / 2; ++i)
    {
        checksum16 = checksum16 ^ (*p16);
        ++p16;
    }

    checksum16 = ((checksum16 & 0xff) << 8) | ((checksum16 & 0xff00) >> 8);

    if (checksum16 != crc_val)
    {
        result =  __LINE__;
        goto L_Return;
    }

L_Return:
    DFU_PRINT_INFO4("<==dfu_check_buf_crc: length=%d, checksum16=0x%x, crc_val=0x%x, result:%d",
                    length, checksum16, crc_val, result);
    return result;
}

/**
*  @brief: unlock flash is need when erase or write flash.
*/
bool unlock_flash_bp_all(void)
{
    DFU_PRINT_TRACE0("**********Flash unlock BP***********");
    if (flash_sw_protect_unlock_by_addr_locked(0x00800000, &g_flash_old_bp_lv))
    {
        DFU_PRINT_TRACE1("<==Unlock Total Flash Success! prev_bp_lv=%d", g_flash_old_bp_lv);
        return true;
    }
    return false;
}

/**
*  @brief: lock flash after erase or write flash.
*/
void lock_flash_bp(void)
{
    if (g_flash_old_bp_lv != 0xff)
    {
        flash_set_block_protect_locked(g_flash_old_bp_lv);
    }
}

/**
 * @brief erase a sector of the flash, will retry three times at most
 *
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @return  0 if erase successfully, error line number otherwise,
*/
uint32_t dfu_flash_erase_sector_with_retry(uint16_t image_id, uint32_t offset)
{
    uint32_t result = 0;
    uint32_t cnt = 0;
    uint32_t dfu_base_addr = 0;

    if (image_id == IMAGE_USER_DATA)
    {
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);;
    }
    else
    {
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
    }
    if (dfu_base_addr == 0)
    {
        result = __LINE__;
        goto L_Return;
    }

    do
    {
        unlock_flash_bp_all();
        flash_erase_sector(dfu_base_addr + offset);
        lock_flash_bp();
        result = dfu_flash_check_blank(image_id, offset, FMC_SEC_SECTION_LEN);

        if (!result)
        {
            //erase ok
            break;
        }
        else
        {
            //retry
            cnt++;
        }
        if (cnt >= 3)
        {
            /*retry three times all fail*/
            goto L_Return;
        }
    }
    while (1);

L_Return:
    DFU_PRINT_INFO2("dfu_flash_erase_with_retry: cnt=%d, result=%d",
                    cnt, result);
    return result;
}


/**
 * @brief  write specified image data with specified length to flash
 * @param  image_id          image_id to identify FW.
 * @param  offset             offset of the image.
 * @param  length             length of data.
 * @param  p_void             pointer to data.
 * @return 0 if write FW image successfully, error line number otherwise
*/
uint32_t dfu_update(uint16_t image_id, uint32_t offset, uint32_t length,
                    uint32_t *p_void, bool is_new_image)
{
    uint32_t result = 0;
    uint32_t dfu_base_addr = 0;
    uint32_t start_addr = 0;
    bool erase_rst = true; //default value must be true

    DFU_PRINT_INFO2("==>dfu_update: offset=0x%x, length=%d", offset, length);

    if (length % 4)
    {
        result = DFU_UPDATE_ERROR_LEN_NOT_ALIGN;
        goto L_Return;
    }

    if (p_void == 0)
    {
        result = DFU_UPDATE_ERROR_EMPTY_BUFFER;
        goto L_Return;
    }

    if (IMAGE_USER_DATA != image_id)
    {
        /*get back up area address*/
        dfu_base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
    }
    else
    {
        /*get back up area address*/
        dfu_base_addr = flash_get_bank_addr(FLASH_BKP_DATA1);
    }

    if (dfu_base_addr == 0)
    {
        result = DFU_UPDATE_ERROR_BASE_ADDR_INVALID;
        goto L_Return;
    }

    /* before erase temp image or write image to flash temp, check access length depend flash layout */
    if (!check_dfu_update_image_length(image_id, offset, length, p_void, &result))
    {
        goto L_Return;
    }

    /*if it's start_packet*/
//    if (offset == 0)
    if (is_new_image)
    {
        T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_void;
        /*access ram addr, make sure image is not ready*/
        p_header->ctrl_flag.flag_value.not_ready = 0x1;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
        if (IMAGE_COMPRESSED == p_header->ctrl_flag.flag_value.image_type)
        {
            /*access ram addr, make sure image is not ready*/
            p_header->ctrl_flag.flag_value.compressed_not_ready = 0x1;
        }

#endif
        if (IMAGE_USER_DATA == image_id)
        {
            img_total_len = p_header->payload_len + IMG_HEADER_SIZE;

            if (0 == (dfu_base_addr & (FMC_BLK_SECTION_LEN - 1)))  //start addr 64k align
            {
                total_block_cnt = img_total_len / FMC_BLK_SECTION_LEN;
                DFU_PRINT_TRACE2("<==dfu_update: img_total_len=0x%x, total_block_cnt=%d",
                                 img_total_len, total_block_cnt);
            }
            else
            {
                /*improve user data ota performance with the limitation of start addr aligned 64K*/
                DBG_DIRECT("Error User data start addr not aligned 64K!");

                result = DFU_UPDATE_ERROR_FLASH_ERASE_LEN_NOT_ALIGN;
                goto L_Return;
            }

            if (0 != (img_total_len & (FMC_BLK_SECTION_LEN - 1)))  //img_total_len is not align 64KB
            {
                if (length > FMC_SEC_SECTION_LEN)
                {
                    /*DFU_TEMP_BUFFER_SIZE can't larger than 4KB if user data size not aligned 64KB,
                    otherwise DFU_TEMP_BUFFER_SIZE can't larger than 64KB when user data size aligned 64KB*/
                    DBG_DIRECT("Error DFU_TEMP_BUFFER_SIZE > 4KB");

