shan-hongzhi/MIOT-RTL8762E-B12G/vendor/realtek/BEE3_SDK_V1.4.1/sdk/src/platform/dfu_flash.c
                    result = __LINE__;
                    goto L_Return;

                }
            }
        }

        DFU_PRINT_TRACE3("<==dfu_update: New Image Header=0x%x, image_id=0x%x, dfu_base_addr=0x%x",
                         length, image_id, dfu_base_addr);
    }

    start_addr = dfu_base_addr + offset;

    unlock_flash_bp_all();
    if (IMAGE_USER_DATA == image_id)
    {
        if (block_cnt < total_block_cnt)
        {
            if (0 == (offset & (FMC_BLK_SECTION_LEN - 1)))   //new Block starts
            {
                erase_rst = flash_erase_block(start_addr);
                block_cnt ++;
            }
            else  // only cross two block
            {
                if (((offset % FMC_BLK_SECTION_LEN) + length > FMC_BLK_SECTION_LEN)
                    && (length <= FMC_BLK_SECTION_LEN))
                {
                    erase_rst = flash_erase_block((start_addr + length) & ~(FMC_BLK_SECTION_LEN - 1));
                    block_cnt ++;
                }
            }
        }
        else
        {
            /*img_total_len is not align 64KB, need erase sector*/
            if (0 != (img_total_len & (FMC_BLK_SECTION_LEN - 1)))
            {
                if (0 == (offset & (FMC_SEC_SECTION_LEN - 1)))   //new sector starts
                {
                    erase_rst = flash_erase_sector(start_addr);
                }
                else  // only cross two sector
                {
                    if (((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN)
                        && (length <= FMC_SEC_SECTION_LEN))
                    {
                        erase_rst = flash_erase_sector((start_addr + length) & ~(FMC_SEC_SECTION_LEN - 1));
                    }
                }
            }
        }
    }
    else  //other images
    {
        if (0 == (offset & (FMC_SEC_SECTION_LEN - 1)))   //new sector starts
        {
            erase_rst = flash_erase_sector(start_addr);
        }
        else // only cross two sector
        {
            /*write space cross two sector. Note: dfu_base_addr have been 4K align*/
            /*if buffer size more than 4K, may cross more than two sectors*/
            if (((offset % FMC_SEC_SECTION_LEN) + length > FMC_SEC_SECTION_LEN)
                && (length <= FMC_SEC_SECTION_LEN))
            {
                erase_rst = flash_erase_sector((start_addr + length) & ~(FMC_SEC_SECTION_LEN - 1));
            }
        }
    }
    if (!erase_rst)
    {
        //erase fail
        result = DFU_UPDATE_ERROR_FLASH_ERASE_FAIL;
        goto L_Return;
    }

    //write data to flash
    result = dfu_write(start_addr, length, (uint8_t *)p_void);
    lock_flash_bp();

L_Return:
    DFU_PRINT_INFO1("<==dfu_update: result=%d", result);
    return result;
}


/**
 * @brief calculate checksum of the image and compare with given checksum value.
 *
 * @param   image_id     image id to identify image.
 * @return  true if the image integrity check passes, false otherwise
*/
bool dfu_check_checksum(uint16_t image_id, uint32_t offset)
{
    uint32_t error_code = DFU_CHECKSUM_SUCCESS;
    bool check_result = false;
    uint32_t base_addr = 0;
    T_IMG_CTRL_HEADER_FORMAT *p_header;

    if (image_id == IMAGE_USER_DATA)
    {
        /* because flash_get_bank_addr(FLASH_BKP_DATA1) is not located flash block protect range, needn't unlock bp */
        base_addr = flash_get_bank_addr(FLASH_BKP_DATA1) | FLASH_OFFSET_TO_NO_CACHE;
    }
    else
    {
        /* check OTA temp or running bank to see if received image is OK.*/
        base_addr = get_temp_ota_bank_addr_by_img_id((T_IMG_ID)image_id);
    }
    if (base_addr == 0)
    {
        error_code = DFU_CHECKSUM_ERROR_BASE_ADDR_INVALID;
        goto L_Return;
    }

    if (!is_ota_support_bank_switch())
    {
        base_addr += offset;
    }

    p_header = (T_IMG_CTRL_HEADER_FORMAT *)base_addr;
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
    if (IMAGE_NORMAL == p_header->ctrl_flag.flag_value.image_type)
    {
        check_result = check_image_chksum(p_header);

    }
    else if (IMAGE_COMPRESSED == p_header->ctrl_flag.flag_value.image_type)
    {
        check_result = check_compressed_image_chksum(p_header);
    }
    else
    {
        error_code = DFU_CHECKSUM_ERROR_IMAGE_TYPE_INVALID;
        goto L_Return;
    }
#else
    check_result = check_image_chksum(p_header);
#endif

    if (!check_result)
    {
        error_code = DFU_CHECKSUM_ERROR_CHECK_FAIL;
        goto L_Return;
    }

    /*when disable bank switch, set image ready later*/
    if (is_ota_support_bank_switch())
    {
        dfu_set_image_ready(p_header);
    }

L_Return:
    DFU_PRINT_INFO3("<==dfu_check_checksum: check_result:%d, ota_tmp_addr:0x%x, error_code:%d",
                    check_result, base_addr, error_code);
    return check_result;
}

void dfu_set_image_ready(T_IMG_CTRL_HEADER_FORMAT *p_header)
{
    unlock_flash_bp_all();
#if (SUPPORT_PUBLIC_DECODE_OTA == 1)
    /*only set compressed_not_reay to 0, and not_ready still is 1
    so that bootlader won't copy compressed image*/
    if (IMAGE_COMPRESSED == p_header->ctrl_flag.flag_value.image_type)
    {
        dfu_set_compressed_ready(p_header);
    }
    else if (IMAGE_NORMAL == p_header->ctrl_flag.flag_value.image_type)
    {
        dfu_set_ready(p_header);
    }
    else
    {
        return;
    }
#else
    dfu_set_ready(p_header);
#endif
    lock_flash_bp();
}


#if (ENABLE_BANK_SWITCH_COPY_APP_DATA == 1)
extern uint8_t *p_ota_temp_buffer_head;
/**
 * @brief   copy appdata from active bank to updating bank.
 *
 * @param   image_id    image_id to identify image.
 * @param   dlAddress   address the img copy to.
 * @param   dlSize      copy size.
 * @return  true if the image copied success, false otherwise
*/
bool dfu_copy_img(uint16_t image_id, uint32_t dlAddress, uint32_t dlSize)
{
    uint32_t error_code = 0;
    uint32_t source_base_addr;
    uint32_t dest_base_addr;
    int remain_size = dlSize;
    uint32_t s_val;
    uint32_t dlOffset, tmp_offset;

    if ((image_id < AppData1) || (image_id > AppData6))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dlAddress % 4096)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    source_base_addr = get_active_ota_bank_addr() & 0xffffff;

    if (flash_get_bank_addr(FLASH_OTA_BANK_0) == get_active_ota_bank_addr())
    {
        dest_base_addr = flash_get_bank_addr(FLASH_OTA_BANK_1) & 0xffffff;
    }
    else
    {
        dest_base_addr = flash_get_bank_addr(FLASH_OTA_BANK_0) & 0xffffff;
    }
    if ((source_base_addr % 4096) || (dest_base_addr % 4096))
    {
        error_code = __LINE__;
        goto L_Return;
    }
    if (dest_base_addr >= dlAddress)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    dlOffset = dlAddress - dest_base_addr;
    tmp_offset = dlOffset;
    if (dlOffset % 4096)
    {
        error_code = __LINE__;
        goto L_Return;
    }
    T_IMG_HEADER_FORMAT *p_data_header;
    p_data_header = (T_IMG_HEADER_FORMAT *)(source_base_addr + dlOffset);
    if (p_data_header->ctrl_header.image_id != image_id)
    {
        error_code = __LINE__;
        goto L_Return;
    }

    while (remain_size > 0)
    {
        if (!((dest_base_addr + tmp_offset) % 4096)) //must 4k align
        {
            flash_erase_sector(dest_base_addr + tmp_offset);
        }
        if (remain_size > 2048)
        {
            memcpy(p_ota_temp_buffer_head, (uint8_t *)(source_base_addr + tmp_offset), 2048);
            if (remain_size ==  dlSize)
            {
                T_IMG_CTRL_HEADER_FORMAT *p_header = (T_IMG_CTRL_HEADER_FORMAT *) p_ota_temp_buffer_head;
                p_header->ctrl_flag.flag_value.not_ready = 0x1; /*make sure image is not ready, will use it later*/
            }
            for (int i = 0; i < 2048; i = i + 4)
            {
                flash_auto_write_locked(dest_base_addr + tmp_offset + i, *(uint32_t *)p_ota_temp_buffer_head);

